### ** Importation du dataset**

In [1]:
import pandas as pd

In [2]:
naissances = pd.read_csv('births.csv')

In [3]:
naissances.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

**exploration de notre dataset**

In [4]:
naissances.describe()

               year         month           day         births
count  15547.000000  15547.000000  15067.000000   15547.000000
mean    1979.037435      6.515919     17.769894    9762.293561
std        6.728340      3.449632     15.284034   28552.465810
min     1969.000000      1.000000      1.000000       1.000000
25%     1974.000000      4.000000      8.000000    4358.000000
50%     1979.000000      7.000000     16.000000    4814.000000
75%     1984.000000     10.000000     24.000000    5289.500000
max     2008.000000     12.000000     99.000000  199622.000000

In [5]:
naissances.shape

(15547, 5)

In [6]:
#exploration des données manquantes
naissances[naissances['day'].isna()]

       year  month  day gender  births
15067  1989      1  NaN      F  156749
15068  1989      1  NaN      M  164052
15069  1989      2  NaN      F  146710
15070  1989      2  NaN      M  154047
15071  1989      3  NaN      F  165889
...     ...    ...  ...    ...     ...
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

[480 rows x 5 columns]

In [7]:
#exploration des données entre 1960 et 1990

naissances[(naissances['year']>= 1960) & (naissances['year']<1990)].describe()

               year         month           day         births
count  15091.000000  15091.000000  15067.000000   15091.000000
mean    1978.434232      6.516401     17.769894    4939.277318
std        5.772857      3.449558     15.284034    6618.989878
min     1969.000000      1.000000      1.000000       1.000000
25%     1973.000000      4.000000      8.000000    4345.000000
50%     1978.000000      7.000000     16.000000    4786.000000
75%     1983.000000     10.000000     24.000000    5248.000000
max     1989.000000     12.000000     99.000000  188074.000000

In [8]:
naissances[(naissances['year']>=1960)& ( naissances['year']<1990)].head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [9]:
naissances[(naissances['year']>=1960) & (naissances ['year']<1990)].tail()

       year  month  day gender  births
15086  1989     10  NaN      M  176258
15087  1989     11  NaN      F  159013
15088  1989     11  NaN      M  166923
15089  1989     12  NaN      F  164186
15090  1989     12  NaN      M  172022

### Nettoyage du dataset

In [10]:
#exploration des  valeurs manquantes (True si elles sont manquantes et False sinon#)
naissances.isnull().tail()

        year  month   day  gender  births
15542  False  False  True   False   False
15543  False  False  True   False   False
15544  False  False  True   False   False
15545  False  False  True   False   False
15546  False  False  True   False   False

In [11]:
#'nonnull' retourne l'opposé de 'isnull'(True si elles sont presentes, False is missing) )
naissances.notnull().tail()

       year  month    day  gender  births
15542  True   True  False    True    True
15543  True   True  False    True    True
15544  True   True  False    True    True
15545  True   True  False    True    True
15546  True   True  False    True    True

In [12]:
# suppression des lignes vides
naissances.dropna().shape

(15067, 5)

In [13]:
naissances.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [14]:
#mise en place d'une nouvelle colonne au format datetime
naissances['date']= pd.to_datetime(naissances[['year','month','day']],errors = 'coerce')

In [15]:
naissances.head()

   year  month  day gender  births       date
0  1969      1  1.0      F    4046 1969-01-01
1  1969      1  1.0      M    4440 1969-01-01
2  1969      1  2.0      F    4454 1969-01-02
3  1969      1  2.0      M    4548 1969-01-02
4  1969      1  3.0      F    4548 1969-01-03

In [16]:
#la colonne date est bien de type datetime
naissances.dtypes

year               int64
month              int64
day              float64
gender            object
births             int64
date      datetime64[ns]
dtype: object

In [18]:
#plusieurs attributs sont donc disponibles
naissances.date.dt.day_name().head()

0    Wednesday
1    Wednesday
2     Thursday
3     Thursday
4       Friday
Name: date, dtype: object

In [19]:
#vérification des valeurs manquantes
naissances.isna().sum()

year        0
month       0
day       480
gender      0
births      0
date      937
dtype: int64

In [20]:
#retire les lignes avec les valeurs manquantes
naissances.dropna(inplace=True)

In [21]:
#verification
naissances.isna().sum()

year      0
month     0
day       0
gender    0
births    0
date      0
dtype: int64

In [22]:
#verification de notre dataset ainsi transformé
naissances.head()

   year  month  day gender  births       date
0  1969      1  1.0      F    4046 1969-01-01
1  1969      1  1.0      M    4440 1969-01-01
2  1969      1  2.0      F    4454 1969-01-02
3  1969      1  2.0      M    4548 1969-01-02
4  1969      1  3.0      F    4548 1969-01-03

In [23]:
#creation d'une colonne avec les jours de la semaine
naissances['weekday']= naissances.date.dt.day_name()

In [24]:
naissances.head()

   year  month  day gender  births       date    weekday
0  1969      1  1.0      F    4046 1969-01-01  Wednesday
1  1969      1  1.0      M    4440 1969-01-01  Wednesday
2  1969      1  2.0      F    4454 1969-01-02   Thursday
3  1969      1  2.0      M    4548 1969-01-02   Thursday
4  1969      1  3.0      F    4548 1969-01-03     Friday

In [25]:
#groupement des résultats par decennie
year1960 = naissances[naissances['year']<1970].groupby('weekday')
year1970 = naissances[naissances['year']<1980].groupby('weekday')
year1980 = naissances[naissances['year']<1990].groupby('weekday')

In [26]:
year1960.sum()

             year  month     day  births
weekday
Friday     204776    672  1682.0  531220
Monday     204776    684  1630.0  526638
Saturday   204776    678  1606.0  483710
Sunday     204776    680  1648.0  451604
Thursday   204776    670  1640.0  517742
Tuesday    204776    688  1612.0  549754
Wednesday  208714    692  1658.0  537910

In [27]:
year1970.sum()

              year  month      day   births
weekday
Friday     2266150   7492  18128.0  5523728
Monday     2266160   7488  18044.0  5422056
Saturday   2266154   7486  18000.0  4876637
Sunday     2266156   7498  18050.0  4605971
Thursday   2266148   7482  18016.0  5421330
Tuesday    2262204   7476  18030.0  5640187
Wednesday  2266144   7490  18084.0  5487802

In [28]:
year1980.sum()

              year  month      day    births
weekday
Friday     4131114  13606  32898.0  10593230
Monday     4127152  13620  32830.0  10371795
Saturday   4131120  13604  32860.0   9091504
Sunday     4127148  13600  32814.0   8646988
Thursday   4131108  13612  32822.0  10434806
Tuesday    4127158  13620  32724.0  10813799
Wednesday  4131100  13638  32862.0  10533386